In [ ]:
*************DataFrame***************

In [5]:
import pandas as pd
data={"state":["india","pak","usa","mexico","london","italy"],
      "popu":[1.6,1.8,1.9,4,6.0,3.7],
      "year":["2000","2001","2011","2004","2008","2014"]}
obj=pd.DataFrame(data)
obj

    state  popu  year
0   india   1.6  2000
1     pak   1.8  2001
2     usa   1.9  2011
3  mexico   4.0  2004
4  london   6.0  2008
5   italy   3.7  2014

In [6]:
obj.head()
#For large DataFrames, the head method selects only the first five rows:

    state  popu  year
0   india   1.6  2000
1     pak   1.8  2001
2     usa   1.9  2011
3  mexico   4.0  2004
4  london   6.0  2008

In [7]:
obj.tail()
#Similarly, tail returns the last five rows:

    state  popu  year
1     pak   1.8  2001
2     usa   1.9  2011
3  mexico   4.0  2004
4  london   6.0  2008
5   italy   3.7  2014

In [27]:
pd.DataFrame(data, columns=["year", "state", "popu"])

   year   state  popu
0  2000   india   1.6
1  2001     pak   1.8
2  2011     usa   1.9
3  2004  mexico   4.0
4  2008  london   6.0
5  2014   italy   3.7

In [28]:
frame=pd.DataFrame(data, columns=["year", "state", "popu", "debt"])
frame

   year   state  popu debt
0  2000   india   1.6  NaN
1  2001     pak   1.8  NaN
2  2011     usa   1.9  NaN
3  2004  mexico   4.0  NaN
4  2008  london   6.0  NaN
5  2014   italy   3.7  NaN

In [10]:
data["state"]

['india', 'pak', 'usa', 'mexico', 'london', 'italy']

In [11]:
data["popu"]

[1.6, 1.8, 1.9, 4, 6.0, 3.7]

In [17]:
frame.loc[1]

year     2001
state     pak
pop       NaN
debt      NaN
Name: 1, dtype: object

In [18]:
frame.iloc[2]

year     2011
state     usa
pop       NaN
debt      NaN
Name: 2, dtype: object

In [29]:
import numpy as np
frame["debt"] = np.arange(6.)
frame

   year   state  popu  debt
0  2000   india   1.6   0.0
1  2001     pak   1.8   1.0
2  2011     usa   1.9   2.0
3  2004  mexico   4.0   3.0
4  2008  london   6.0   4.0
5  2014   italy   3.7   5.0

In [32]:
frame["east"]=frame["state"]=="pa
frame

   year   state  popu  debt   east
0  2000   india   1.6   0.0  False
1  2001     pak   1.8   1.0   True
2  2011     usa   1.9   2.0  False
3  2004  mexico   4.0   3.0  False
4  2008  london   6.0   4.0  False
5  2014   italy   3.7   5.0  False

In [44]:
del frame["popu"]
frame.columns

Index(['year', 'state'], dtype='object')

In [45]:
frame

   year   state
0  2000   india
1  2001     pak
2  2011     usa
3  2004  mexico
4  2008  london
5  2014   italy

In [48]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}
frame2=pd.DataFrame(populations)
frame2

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [49]:
frame2.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [53]:
#2Darray
import numpy as np
import pandas as pd
data=np.array([[1,2,3],[4,5,6]])
df=pd.DataFrame(data, columns=['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6

In [54]:
#Dictionary of arrays or list or tuples
import numpy as np
import pandas as pd
data={'A':[1,2,3],'B':[4,5,6]}
df=pd.DataFrame(data)
df

   A  B
0  1  4
1  2  5
2  3  6

In [55]:
#Numpy structured array
import numpy as np
import pandas as pd
data=np.array([(1,'a'),(2,'b'),(3,'c')],
              dtype=[('A',int),('B',str)])
df=pd.DataFrame(data)
df

   A B
0  1
1  2
2  3

In [56]:
#Dictionary of series
import numpy as np
import pandas as pd
data={'A':pd.Series([1,2,3]),'B':([4,5,6])}
df=pd.DataFrame(data)
df

   A  B
0  1  4
1  2  5
2  3  6

In [59]:
#Dictionary of dictionaries 
import numpy as np
import pandas as pd
data={'A':{'a':1,'b':2,'c':3},'B':{'a':4,'b':5,'c':6}}
df=pd.DataFrame(data)
df

   A  B
a  1  4
b  2  5
c  3  6

In [60]:
#List of dictionaries or series
import numpy as np
import pandas as pd
data=[{'A':1,'B':4},{'A':2,'B':5},{'A':3,'B':6}]
df=pd.DataFrame(data)
df

   A  B
0  1  4
1  2  5
2  3  6

In [63]:
#List of lists or tuples
import numpy as np
import pandas as pd
data=[[1,4],[2,5],[3,6]]
df=pd.DataFrame(data, columns=['A','B'])
df

   A  B
0  1  4
1  2  5
2  3  6

In [64]:
#Another DataFrame
import numpy as np
import pandas as pd
df1=pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
df2=pd.DataFrame({'A':[7,8,9],'B':[10,11,12]})
df=pd.concat([df1, df2])
df

   A   B
0  1   4
1  2   5
2  3   6
0  7  10
1  8  11
2  9  12

In [ ]:
#Numpy MaskedArray
import numpy.ma as ma
data=ma.array([[1,2,3],[4,ma.masked,6]])
df=pd.DataFrame